app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @song = Song.new(artist_id: params[:artist_id])
    @artist = Artist.find_by_id(params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 3], ["id", 20]]
---
  def edit
    @song = Song.find_by_id(params[:id])
    @artist = Artist.find_by_id(params[:artist_id])
    if params[:artist_id]
      if !@artist
        redirect_to artists_path, alert: "Artist not found"
      elsif !@artist.songs.find_by_id(params[:id])